-----
-- huashan.lua
--
-- ----------------------------------------------------------
-- 华山派自有
-- ----------------------------------------------------------
--
--[[

eg.

--]]

DGJJ_setpo = {
    ["修罗刀"] = "set po 刀",
    ["火焰刀"] = "set po 刀",
    ["慈悲刀"] = "set po 刀",
    ["烈焰刀"] = "set po 刀",
    ["血刀经"] = "set po 刀",
    ["烈焰刀"] = "set po 刀",
    ["反两仪刀"] = "set po 刀",
    ["玄虚刀法"] = "set po 刀",
    ["柳叶刀法"] = "set po 刀",
    ["燃木刀法"] = "set po 刀",
    ["雁行刀法"] = "set po 刀",
    ["慕容刀法"] = "set po 刀",
    ["五虎断门刀"] = "set po 刀",
    ["四象六合刀"] = "set po 刀",
    ["烈火剑"] = "set po 剑",
    ["伏魔剑"] = "set po 剑",
    ["达摩剑"] = "set po 剑",
    ["冲灵剑法"] = "set po 剑",
    ["慕容剑法"] = "set po 剑",
    ["辟邪剑法"] = "set po 剑",
    ["太极剑法"] = "set po 剑",
    ["金蛇剑法"] = "set po 剑",
    ["两仪剑法"] = "set po 剑",
    ["玉箫剑法"] = "set po 剑",
    ["段家剑法"] = "set po 剑",
    ["全真剑法"] = "set po 剑",
    ["华山剑法"] = "set po 剑",
    ["嵩山剑法"] = "set po 剑",
    ["玄铁剑法"] = "set po 剑",
    ["苗家剑法"] = "set po 剑",
    ["玄阴剑法"] = "set po 剑",
    ["独孤九剑"] = "set po 剑",
    ["迅雷十六剑"] = "set po 剑",
    ["回风拂柳剑"] = "set po 剑",
    ["玉女素心剑"] = "set po 剑",
    ["裂天斧"] = "set po 鞭",
    ["圣火令法"] = "set po 鞭",
    ["银钩笔法"] = "set po 鞭",
    ["腾龙匕法"] = "set po 鞭",
    ["盘根错结斧"] = "set po 鞭",
    ["金刚降伏轮"] = "set po 鞭",
    ["天山追魂钩"] = "set po 鞭",
    ["弹指神通"] = "set po 箭",
    ["含沙射影"] = "set po 箭",
    ["漫天花雨"] = "set po 箭",
    ["夺命金花"] = "set po 箭",
    ["回风鞭"] = "set po 索",
    ["嵩阳鞭"] = "set po 索",
    ["慈航鞭"] = "set po 索",
    ["灵蛇鞭法"] = "set po 索",
    ["日月鞭法"] = "set po 索",
    ["银索金铃"] = "set po 索",
    ["九阴银龙鞭"] = "set po 索",
    ["韦陀杵"] = "set po 枪",
    ["疯魔杖"] = "set po 枪",
    ["无常杖"] = "set po 枪",
    ["普渡杖"] = "set po 枪",
    ["韦驮棍"] = "set po 枪",
    ["少林醉棍"] = "set po 枪",
    ["打狗棒法"] = "set po 枪",
    ["天山杖法"] = "set po 枪",
    ["无上大力杵"] = "set po 枪"
}
