--
-- init.lua
--
-- ----------------------------------------------------------
-- 不同门派各自的独立文件, 如华山, 桃花等
-- ----------------------------------------------------------
--
--[[


eg.

require "Sect"


--]]
Sect = {}

-- ---------------------------------------------------------------
-- 清除所有单独门派特色的加载, 避免在公共部分加载时,因有残留trigger造成异常
-- ---------------------------------------------------------------
function Sect.ClearAll()
    -- 慕容
    DeleteTriggerGroup("dzxy")
    -- 古墓
    DeleteTriggerGroup("gmpfmException")
end

-- ---------------------------------------------------------------
-- 根据角色门派加载所需要用到的部分
-- ---------------------------------------------------------------
function Sect.Onload()
    if score.party == "姑苏慕容" then
        print("正在加载 姑苏慕容的档案.")
        require "/Sect/murong"
        dzxy()
    end
    if score.party == "古墓派" then
        print("正在加载 古墓派的档案.")
        require "/Sect/gumu"
        gmpfmExceptionOn()
    end
    if score.party == "华山派" then
        print("正在加载 华山派的档案.")
        require "/Sect/huashan"
        -- gmpfmExceptionOn()
    end
end

-- ---------------------------------------------------------------
-- 在加载前先清除所有已加载的各自门派独有的部分
-- ---------------------------------------------------------------
Sect.ClearAll()