--
-- init.lua
--
-- ----------------------------------------------------------
-- 不同门派各自的独立文件, 如华山, 桃花等
-- ----------------------------------------------------------
--
--[[


eg.

require "Sect"


--]]

Sect = { }

-- ---------------------------------------------------------------
-- 根据角色门派加载所需要用到的部分 
-- ---------------------------------------------------------------
function Sect.Onload()
    if score.party == "姑苏慕容" then
        print("正在加载 姑苏慕容的档案.")
        require "/Sect/murong"
    end
end


